[
    {
        "title": "Traveling Through Time",
        "content": "It felt so realistic... I dreamt that I was standing in the middle of a beautiful meadow. I was surrounded by tall grass and wildflowers. While I looking up at the clear blue sky I suddenly felt a strange sensation wash over me. It was like my body was being pulled in all different directions at once. \nSuddenly, I found myself falling through a tunnel of light, hurtling through space and time. When I finally came to a stop, I found myself in a bustling city that I didn't recognize. I looked down at my phone and realized that I had traveled forward in time by several decades. \nI spent the next few hours exploring the city, marveling at all the technological advances and futuristic architecture. \nBut soon after, I felt a wave of anxiety and nausea. I grew homesick for my own time and longed to go back. As I closed my eyes and focused on my desire to return home, I felt that same strange sensation once again. When I opened my eyes, I found myself in a new city, but it was as if it contained pieces of the past and future combined. \nI woke up from my dream feeling exhilarated and a little bit disoriented. The dream felt so realistic, but I just knew that it could not have happened. Even though it was just a dream, the memory of my dream time travel adventure stayed wiht me for days to come.",
        "img": "img/dream_pic1.jpg",
        "feeling": "Happy",
        "dreamType": "Normal Dream"
    },

    {
        "title": "Teleporting to a New World",
        "content": "In my dream, I remember bending down on a bustling street to pick up a unique coin, but when I made contact with it, all of the energy in my body was just gone. For what felt like an eternity, I eventually awoke and found myself standing alone. It was empty, and there was nothing but barren earth stretching out before me as far as the eye could see. As I looked around, I realized that I had no idea of where I was. \nSuddenly, I felt a rush of energy coursing through my body, and I was lifted off the ground and transported through space and time. When I landed, I found myself standing in the middle of a bustling marketplace, but with strange people speaking in a language that I couldn't understand. \nAs I explored this new world, I discovered that it was full of wonder nd magic. There were floating islands in the sky, exotic creatures roaming the forests, and ancient ruins that held secrets beyond my wildest imagination. But with all this wonder and magic came danger as well. I saw a crowd of people running in my direction, and cloaked figures slowly following behind them. There were dark forces at work in this new world, and I found myself caught up in the chaos of it. \nBefore I knew it, the cloaked figure caught up to me and then I had woken up in a cold sweat.",
        "img": "img/dream_pic2.jpg",
        "feeling": "Scared",
        "dreamType": "Nightmare"
    }, 

    {
        "title": "Talking to the Deceased",
        "content": "I was walking through a peaceful garden, surrounded by flowers and trees. Everything was so pretty. As I strolled through the garden, I saw a figure in the distance, waving to me. As I got closer, I realized that it was my grandmother, who had passed away many years. Beside her stood my grandfather, who had passed away just a couple years ago. \nAt first I was frightened and confused, but as she began to speak to me, I felt a sense of calm and peace wash over me. She told me that she had come to visit me beacuse she wanted to reassure me that she was still with me, even though she had passed away. My grandfather was not a man of many words, and even then, he smiled and pat my head. \n We talked for what seemed like hours, reminiscing about old times and catching up on all the news of the family. It was like they had never left, and I found myself feeling comforted and happy to be able to talk to them again. \nAs the dream began to wind down, my grandparents hugegd me tightly and told me that she had to go, but that she woul always be with me in spirit. As I watched them fade away into the garden, I knew that I would never forget the experience of talking to her again, even if it was only in my dreams. \nWhen I woke up from the dream, I felt a sense of peace and comfort, knowing that my grandparents were still with me in some way. While I knew that I would never be able to talk to them again in person, the dream reminded me that the love and connection I shared with them was still alive and well, even after all thses years and after their passing.",
        "img": "img/dream_pic3.jpg",
        "feeling": "Sad",
        "dreamType": "Normal Dream"
    }, 

    {
        "title": "Suddenly I'm an Acrobat",
        "content": "I could see myself doing what the girls in the gymnsatics clubs did as I watched them rehearse their routines for the competition. In fact, I saw myself doing even more. In my dream, I found myself standing in the middle of a circus tent, surrounded by trapeze artists, tightrope wlkers, and other acrobats. At first, I was confused about why I was there, but as I looked at my own body, I realized that I was wearing a sparkling, sequined leotard, and I felt an unfamiliar strength and grace coursing through my limbs. \nBefore I knew it, the ringmaster called out my name, and I was lifted up into the air by a group of other acrobats. They threw me from one end of the tent to the other, as I executed flips and twists that I never thoguht I was capable of. I couldn't help but smile as the audience cheered and clapped with increasing volumes. I landed perfectly on the other side of the tent, feeling exhilarated and alive. \nI found myself performing daring feats on the trapeze, soaring through the air with the greatest of ease. I felt completely confident and fearless, as if I had been an acrobat my entire life. \nWhen the performance was over, I was greeted with cheers and applause from the crowd, and I knew that I had found my true calling as an acrobat. As I walked out of the tent, still feeling the rush of adrenaline, I knew that my life would never be the same again. \nThat is, until I heard a familiar voice repeatedly calling my name. I woke up from my dream, realizing that I had been spacing out.",
        "img": "img/dream_pic4.jpg",
        "feeling": "Natural",
        "dreamType": "Daydream"
    },

    {
        "title": "I Became an Animal",
        "content": "I found myself in a lush garden, surrounded by blooming flowers and fluttering butterflies. As I walked through the garden, I suddenly felt a strange sensation in my body, as if I was being transformed in some way. Before I knew it, the flowers that I looked at from above were now looming over me. \nWhen I had found a piece of a glass shard, I could see my reflection. I became a butterfly. I looked at my wings and saw that they were a beautiful shade of pink, with delicate patterns ethced into the surface. As I tried to understand how to fly as beautifully as normal butterflies do, I could only feel a sense of fear and anxiety that I had not anticipated. My heart continued to race as the confusion took over. I wanted to go back to my own body, but at the same time, I was enjoying being abe to fly through the garden with ease and grace, flitting from flower to flower and sipping nectar from their sweet centers. \nIt was fun until I had been struck by something, which damaged my wing and caused me to fall. I was suddenly aware of how small and fragile I was. I was vulnerable to predators, and as the wind felt stronger, I could feel myself almost getting swept away. I tried to flap my wings faster and faster to get out of the wind's grasp, but it was too strong. \nI woke up breathing heavily, and realizing that it was all a dream. But it was so unsettling and scary.",
        "img": "img/dream_pic5.jpg",
        "feeling": "Scared",
        "dreamType": "Normal Dream"
    }, 

    {
        "title": "Living on Another Planet",
        "content": "I was standing there all alone on another planet, far away from Earth. I called out the names of my best friends, but there was nothing but echoes of my voice. The landscape was unfamiliar and barren, with towering mountains and craggy valley stretching out in every direction. \nAt first, I was amazed and excited by the discovery of this new world. I explored the terrain, marveling at the strange plants and animals that I encountered along the way. The sky was a deep shade of purple, and the stars shone like diamonds against the dark sky. Suddenly, I heard my name being called, but I didn't recognize the voices, yet these aliens recognized me. How could this be? I asked them who they were, but I was only given looks of confusion. They took me to their house, to which there was even a clearly drawn image of me with them like a family photo, but I don't remember even being there for it. I felt so alone and lost. I just wanted to return back to Earth..",
        "img": "img/dream_pic6.jpg",
        "feeling": "Sad",
        "dreamType": "Lucid"
    }

]